# Задача 1. Календарь
dayoftheweek = input('Введите день недели: ')
num = 1

for day in ('понедельник', 'вторник', 'среда', 'четверг', 'пятница'):
  if day != dayoftheweek:
    num += 1
  else:
    break
print('Номер дня недели =', num)

# =========================================================
# Задача 2. Я стал новым пиратом!
word = 'Карамба'
count = 0

for pirate in range (10):
  pirate = input('Введите слово: ')
  if pirate == word:
    count += 1
print(count, 'слов из них совпадают со словом "Карамба"')

# =========================================================
# Задача 3. Кривой мессенджер
text = input('Введите текст: ')
count = 0

for simbol in (text):
  if simbol == '*':
    count += 1
print('Символ "*" стоит на позиции', count)

# =========================================================
# Задача 4. Театр
rows = int(input('Введите кол-во рядов: '))
seats = int(input('Введите кол-во сидений в ряде: '))
meters = int(input('Введите кол-во свободных метров между рядами: '))

print('\nСцена')
for row in range(0, rows):
  print('=' * seats, '*' * meters, '=' * seats)

# =========================================================
# Задача 5. Марсоход 2


# =========================================================
# Задача 6. Спецшифр
line = input('Введите строку: ')
count = count_max = 0

for letter in line:
  if letter == 's':
    count += 1
    if count > count_max:
      count_max = count
  else:
    count = 0
    
print(f'Самая длинная последовательность: {count_max}')

# =========================================================
# Задача 7. Великий и могучий
print('Задача 7. Великий и могучий')

line = input('Введите текст: ')
count = word_max = 0

for letter in line:
  if letter != ' ':
    count += 1
    if count > word_max:
      word_max = count
  else:
    count = 0

print(f'Самая длинная последовательность: {word_max}')

# =========================================================
# Задача 8. Колонтитул
print('Задача 8. Колонтитул')

running_title = int(input('Введите общую длину колонтитула: '))
exclamation_point = int(input('потом желаемое количество восклицательных знаков: '))

half_title = int(running_title / 2)
print('~' * half_title, '!' * exclamation_point, '~' * half_title)

# =========================================================
# Задача 9. Коровы
print('Задача 9. Коровы')

line = input('Вводите строку из 10 символов a и b \nгде a - свободное стойло, b - занятое.: ')
milk = count = 0

for text in (line) :
  count += 2
  if text == 'b':
    milk += count

print(f'Всего произведено молока: {milk} лит.')

# Для коров есть 10 стойл.
# В каждом стойле разные условия для животных, поэтому и молока они дают по-разному.
# В первом стойле производят 2 литра в день,
# во втором 4, 
# в третьем - 6, потом 8, 10, 12, 14, 16, 18, 20. 
# Но коровы стоят не во всех стойлах. 
# Свободные и занятые обозначаются строкой из букв a и b,
# где a - свободное стойло, b - занятое.
# 
# Пользователь вводит строку из 10 символов a и b.
# Необходимо определить, сколько в итоге будет произведено молока за день.

# =========================================================
# Задача 10. Метод бутерброда
print('Задача 10. Метод бутерброда')

word = input('Введите слово: ')
count = 0
part1 = part2 = decoding = ' '

for symbol in word:
  count += 1
  if count % 2 != 0:
    part1 += symbol
  else:
    part2 = symbol + part2
decoding = part1 + part2

print(f'Расшифрованное слово: {decoding}')

# Секретное агентство «Super-Secret-no» решило
# для шифрования переписки своих сотрудников использовать «метод бутерброда».
# Сначала буквы слова нумеруются в таком порядке:
# первая буква получает номер 1,
# последняя буква - номер 2,
# вторая – номер 3,
# предпоследняя – номер 4, потом третья … и так для всех букв (см. рисунок).
# Затем все буквы записываются в шифр в порядке своих номеров.
# 
# Например, слово «sandwich» зашифруется в «shacnidw».
# 
# К сожалению, программист «Super-Secret-no», написал только программу шифрования и уволился.
# И теперь агенты не могут понять, что же они написали друг другу. Помогите им.
# 
# Пример:
# Введите зашифрованное сообщение: shacnidw
# Расшифрованное сообщение: sandwich
#          1   3   5   7   8   6   4   2
# Слово: | s | a | n | d | w | i | c | h |
#
# Шифр:  | s | h | a | c | n | i | d | w |