# Задача 1. Космическая еда
buckwheat = 100
month = 0
for budget in range (buckwheat, 0, -1):
  months = int(input("Гречневый бюджет! Введите число месяцев: "))
  buckwheat -= 4 * months
  month += months
  if buckwheat < 0:
    break
  print('Через', month, 'месяц(ев) осталось', buckwheat, 'кг гречки в запасе')
print('Гречка закончилась!')

# =========================================================
# Задача 1. Космическая еда
weight = 100
month = 0
for index in range(weight, -4, -4):
  print('через', month, 'месяцев останется', index, 'кг гречки')
  month += 1

# =========================================================
# Задача 2. Долги
debts = 0
debtor = int(input('Введите количество должников: '))
for number in range(0, debtor, 5):
  print('Должник с номером', number)
  debt = int(input('Сколько должны? '))
  debts += debt
print('Общая сумма долга: ', debts)

# =========================================================
# Задача 3. Таймер для микроволновых печей


# =========================================================
# Задача 4. Среднее на отрезке


# =========================================================
# Задача 5. Функция 2


# =========================================================
# Задача 6. Письмо


# =========================================================
# Задача 7. Стипендия


# =========================================================
# Задача 8. Сумма ряда


# =========================================================
# Задача 9. Выражение


# =========================================================
# Задача 10. Кинотеатр