# =========================================================
#Задача 1. Тестовое задание
for row in range(0, 6):
  for columns in range(0, 11, 2):
    print(columns + row, end = '\t')
  print()


# Степан пришёл устраиваться на работу, где ему дали тестовое задание:
# проанализировать такую таблицу,
# понять как она строится и написать программу для вывода её на экран.

# 0 2 4 6  8  10
# 1 3 5 7  9  11
# 2 4 6 8  10 12
# 3 5 7 9  11 13
# 4 6 8 10 12 14
# 5 7 9 11 13 15
#
# Помогите Степану реализовать такую программу.
# Подсказка: номера столбцов. А ещё не забудьте про литерал \t для табуляции

# =========================================================
#Задача 2. Лестница
numN = int(input("Введите число: "))

for row in range(1, numN + 1):
  for columns in range(1, numN + 1):
    if columns <= row:
      print(row, end = ' ')
    else:
      print(end = ' ')
  print()

# Пользователь вводит число N.
# Напишите программу, которая выводит такую “лесенку” из чисел:

# Введите число: 5
# 1
# 2 2
# 3 3 3
# 4 4 4 4
# 5 5 5 5 5

# =========================================================
#Задача 3. Рамка
width = int(input("Введите ширину рамки: "))
height = int(input("Введите высоту рамки: "))

for col in range(width + 1):
  for row in range(height + 1):
    if (row == 0) or (row == height):
      print('|', end = ' ')
    elif (col == 0) or (col == width):
      print('—', end = ' ') 
    else:
      print(' ', end = ' ')
  print()

# Напишите программу,
# которая рисует с помощью символьной графики прямоугольную рамку.
# Для вертикальных линий используйте символ вертикального штриха “|”,
# а для горизонтальных - дефис “-”. Пусть пользователь вводит ширину и высоту рамки.

#  _ _ _ _ _ _ _ _ _
# |                 |
# |                 |
# |                 |
# |                 |
# |                 |
# |                 |
# |_ _ _ _ _ _ _ _ _|

# =========================================================
#Задача 4. Крест
for col in range(11):
  for row in range(11):
    if col == row:
      print('^', end = ' ')
    elif col == -row + 10:
      print('^', end = ' ')
    else:
      print(' ', end = ' ')
  print()

# Напишите программу,
# которая выводит на экран крест из символов “^”.
#
# (Символы выводятся по диагоналям воображаемого квадрата.)

# ^        ^
#  ^      ^ 
#   ^    ^  
#    ^  ^   
#     ^^    
#     ^^    
#    ^  ^   
#   ^    ^  
#  ^      ^ 
# ^        ^

# =========================================================
#Задача 5. Простые числа

seqNum = int(input('Введите последовательность чисел: '))
count = 0

for point in range(1, seqNum + 1):
  print('Введите', point, '-е число: ', end = ' ')
  num = int(input())
  count += 1
  for step in range(2, num // 2 + 1):
    if num % step == 0:
      count -= 1
      break
print('Из введенных', count, 'чисел - простых: ', count)

#Напишите программу,
#которая считает количество простых чисел в заданной последовательности 
#и выводит ответ на экран.

# =========================================================
#Задача 6. Сумма факториалов

# Напишите программу,
# которая запрашивает у пользователя число N
# и находит сумму факториалов 1! + 2! + 3! +... + N! 

number = int(input('Введите число N: '))
summ = 0
factorial = 1

for num in range(1, number + 1):
  factorial *= num
  summ += factorial
print('Сумма факториалов с 1 до ', number, '=', summ)

# =========================================================
#Задача 7. Наибольшая сумма цифр

numeral = int(input('Введите кол-во чисел: '))
max_summ = 0
max_num = 0

for point in range(1, numeral + 1):
  summ = 0
  print('Введите', point, '-e число: ', end = ' ')
  num = int(input())
  num2 = num
  while num2 > 0:
    summ += num2 % 10
    num2 //= 10
  if summ > max_summ:
    max_summ = summ
    max_num = num
print('наибольшее число:', max_num, ', а  сумма его цифр равна: ', max_summ)

# Вводится N чисел. 
# Среди натуральных чисел, которые были введены, 
# найдите наибольшее по сумме цифр. Выведите на экран это число и сумму его цифр.

# =========================================================
#Задача 8. Пирамидка
mark = "#"
height = int(input("Введите высоту пирамиды: "))

for row in range(height):
  print(" " * (height - row) + mark * (1 + row * 2))

# Напишите программу,
# которая выводит на экран равнобедренный треугольник (пирамидку),
# заполненный символами хэштега "#". Пусть высота пирамиды вводится пользователем.


# Подсказка: вспомните, как выводился колонтитул вида -----!!!!!!-----
   #
  ###
 #####
#######

# =========================================================
#Задача 9. Пирамидка 2

number = 1
height = int(input("Введите высоту пирамиды: "))

for row in range(1, height + 1):
  print("\t" * (height - row ), end = "")
  for col in range(1, row + 1):
    print("\t", number, end = "\t")
    number += 2
  print()
  
# Напишите программу,
# которая получает на вход количество уровней пирамиды и выводит их на экран,

# Пример:
# 
#             1
#          3     5
#       7     9     11
#    13    15    17    19
# 21    23    25    27    29

# =========================================================
#Задача 10. Яма

height = int(input("Введите глубину ямы: "))

print()
for row in range(1, height + 1):
  
  for col1 in range(0, height):
    if col1 >= row:
      print(".", end = " ")
    else:
      print(height - col1, end = " ")

  for col2 in range(1, height + 1):
    if row <= height - col2:
      print(".", end = " ")
    else:  
      print(col2, end = " ")

  print()
  
# В одной компьютерной текстовой игре рисуются всяческие элементы ландшафта.
#
# Напишите программу,
# которая получает на вход число N и выводит на экран числа в виде “ямы”:

# Введите число: 5
# 
# 5........5
# 54......45
# 543....345
# 5432..2345
# 5432112345